#+TITLE:     Org-Mode Beamer Example
#+AUTHOR:    Derek Feichtinger
#+EMAIL:     derek.feichtinger@psi.ch

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   num:t toc:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS:   tex:t d:nil todo:t pri:nil tags:nil
#+OPTIONS:   timestamp:t

# started this on 2010-03-30 Tue

# this allows defining headlines to be exported/not be exported
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results.
#+PROPERTY: header-args :eval never-export

** Org mode version information

   #+LATEX: \small
  #+BEGIN_SRC emacs-lisp :results output :exports results :eval yes
    (princ (concat (format "Emacs version:\n%s\n" (emacs-version))
                   (format "\norg version: %s\n" (org-version))))
    
  #+END_SRC

  #+RESULTS:
  : Emacs version:
  : GNU Emacs 24.5.1 (x86_64-unknown-linux-gnu, GTK+ Version 3.10.8)
  :  of 2015-05-04 on dflt1w
  : 
  : org version: 8.2.10


** Tables
   The size of the table font can be chosen by giving a =#+LATEX: \small=
   command (or =\tiny= or =\footnotesize=)

   #+LATEX: \footnotesize
    #+NAME: tblWNs2014
    | WNs | Processors         | Cores/node | HS06/node | total cores | total HS06 |
    |-----+--------------------+------------+-----------+-------------+------------|
    |  20 | 2*Xeon X5560       |          8 |       118 |         160 |       2360 |
    |  11 | 2*E5-2670 2.60GHz  |         16 |       263 |         176 |       2893 |
    |   4 | 2*AMD 6272 2.40GHz |         32 |       241 |         128 |        964 |
    |-----+--------------------+------------+-----------+-------------+------------|
    |  35 |                    |            |           |         464 |       6217 |
#+TBLFM: @I$6..@II$6=$1*$4::@I$5..@II$5=$1*$3::@>$1=vsum(@I..@II)::@>$5..@>$6=vsum(@I..@II)

